ensemble-learning/test_cases/S809-airfoil/inputs/foam_base/foam_base_AoA14/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "10000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
71770
(
(0.185436 0.00833165 -2.04831e-23)
(0.191291 0.00649017 3.05213e-23)
(0.201681 0.00400747 -1.03891e-17)
(0.221573 0.00116763 -2.46966e-18)
(0.234972 0.000618939 1.10682e-18)
(0.236353 0.000511923 0)
(0.238559 0.000399083 0)
(0.240339 0.000269846 4.40736e-19)
...
)
;

boundaryField
{
    farfield
    {
        type            freestreamVelocity;
        freestreamValue uniform (46.4604 11.7908 0);
        value           nonuniform List<vector> 
160
(
(46.5264 11.62 3.63448e-18)
(46.5238 11.6188 0)
(46.5194 11.6187 -1.25094e-17)
(46.5391 11.6187 1.07294e-20)
(46.5007 11.61 4.11887e-20)
(46.2757 11.5604 -1.61031e-20)
(46.2514 11.5415 0)
(46.436 11.5916 3.99512e-20)
...
)
;
    }
    walls
    {
        type            noSlip;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
