ensemble-learning/test_cases/S809-airfoil/inputs/foam_base/foam_base_AoA14/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10000";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
71770
(
0.000989698
0.00105215
0.00116847
0.00140928
0.00158461
0.00160355
0.00163385
0.00165854
...
)
;

boundaryField
{
    farfield
    {
        type            freestream;
        freestreamValue uniform 0.001;
        value           nonuniform List<scalar> 
160
(
0.00019792
0.000220473
6.38746e-05
1e-15
0.015612
0.0711363
0.0774463
0.0312828
...
)
;
    }
    walls
    {
        Ceps2           1.9;
        Ck              -0.416;
        Bk              8.366;
        C               11;
        type            kLowReWallFunction;
        value           nonuniform List<scalar> 
621
(
2.6828e-09
3.7043e-10
2.99909e-10
1.39435e-10
8.85233e-11
9.39776e-11
9.82054e-11
9.53037e-11
...
)
;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
