ensemble-learning/test_cases/S809-airfoil/inputs/foam_base/foam_base_AoA14/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10000";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
71770
(
6.67613e-13
7.09733e-13
7.88184e-13
9.50648e-13
1.06895e-12
1.08173e-12
1.10217e-12
1.11882e-12
...
)
;

boundaryField
{
    farfield
    {
        type            freestream;
        freestreamValue uniform 5.4e-05;
        value           nonuniform List<scalar> 
160
(
3.999e-05
4.47998e-05
1.29482e-05
2.13748e-16
0.00312751
0.00963235
0.0100689
0.00548143
...
)
;
    }
    walls
    {
        type            nutUSpaldingWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 
621
(
1.15466e-11
5.47112e-12
5.05509e-12
3.78667e-12
3.1909e-12
3.26442e-12
3.31945e-12
3.28252e-12
...
)
;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
