ensemble-learning/test_cases/S809-airfoil/inputs/foam_base/foam_base_AoA14/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10000";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
71770
(
1.48244e+09
1.48247e+09
1.48248e+09
1.48245e+09
1.4824e+09
1.4824e+09
1.4824e+09
1.4824e+09
...
)
;

boundaryField
{
    farfield
    {
        type            freestream;
        freestreamValue uniform 18;
        value           nonuniform List<scalar> 
160
(
4.94923
4.92129
4.9331
4.67841
4.99184
7.38514
7.69163
5.70704
...
)
;
    }
    walls
    {
        blended         1;
        beta1           0.075;
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
621
(
1.48248e+09
1.48248e+09
1.48246e+09
1.48261e+09
1.48257e+09
1.48242e+09
1.4824e+09
1.4824e+09
...
)
;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
