ensemble-learning/test_cases/S809-airfoil/inputs/foam_base/foam_base_AoA14/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10000";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
71770
(
251.383
247.839
241.48
229.613
205.808
190.254
176.649
163.906
...
)
;

boundaryField
{
    farfield
    {
        type            freestreamPressure;
        freestreamValue uniform 0;
        value           nonuniform List<scalar> 
160
(
0.000113651
7.16881e-05
-5.60667e-05
-5.18584e-05
-0.000199266
7.76449e-05
1.89918e-06
-9.65645e-05
...
)
;
    }
    walls
    {
        type            zeroGradient;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
