ensemble-learning/test_cases/S809-airfoil/inputs/foam_base/foam_base_AoA14/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "10000";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];
oriented        oriented;


internalField   nonuniform List<scalar> 
118861
(
3.77011e-10
3.93078e-10
4.23202e-10
4.5681e-10
4.71243e-10
4.74898e-10
4.78911e-10
4.78077e-10
...
)
;

boundaryField
{
    farfield
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
0.0917791
0.0925284
0.0931305
0.0936364
0.0938761
0.0936257
0.0935906
0.093845
...
)
;
    }
    walls
    {
        type            calculated;
        value           uniform 0;
    }
    BaseAndTop
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
