ensemble-learning/test_cases/S809-airfoil/inputs/foam_base/foam_base_AoA14/0/timeScale
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10000";
    object      timeScale;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 1 0 0 0 0];


internalField   nonuniform List<scalar> 
71770
(
7.49515e-09
7.49502e-09
7.49493e-09
7.49512e-09
7.49534e-09
7.49535e-09
7.49535e-09
7.49535e-09
...
)
;

boundaryField
{
    farfield
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
2.24502
2.25776
2.25236
2.37498
2.22586
1.50452
1.44457
1.94691
...
)
;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
621
(
7.49497e-09
7.49495e-09
7.49503e-09
7.49429e-09
7.4945e-09
7.49527e-09
7.49535e-09
7.49535e-09
...
)
;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
