ensemble-learning/test_cases/S809-airfoil/inputs/foam_base/foam_base_AoA14/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
    // grad(U)         cellLimited Gauss linear 1;
}

divSchemes
{
    default         none;
    // div(phi,U)      Gauss limitedLinearV 1;
    // div(phi,e)      Gauss limitedLinear 1;
    // div(phid,p)     Gauss limitedLinear 1;
    // // div(phi,K)      Gauss limitedLinear 1;
    // div(phiv,p)     Gauss limitedLinear 1;
    // div(phi,k)      Gauss upwind;
    // div(phi,epsilon) Gauss upwind;
    // div((nuEff*dev2(T(grad(U))))) Gauss linear;
    div(phi,U)      bounded Gauss linearUpwind grad(U);
    div(phi,k) bounded Gauss linearUpwind grad(k);
    div(phi,epsilon) bounded Gauss linearUpwind grad(epsilon);
    div(phi,omega) bounded Gauss linearUpwind grad(omega);
    div((nuEff*dev2(T(grad(U)))))  Gauss linear limited corrected 0.5; //Gauss linear;
    div(nonlinearStress)  Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited corrected 0.1;
    // default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
}


// ************************************************************************* //
